<?php
/**
 * Created by PhpStorm.
 * User: qc
 * Date: 2018/9/25
 * Time: 18:43
 */
return [
    'count' => [
        'group' => [
            '1' => "青铜",
            '2' => "白银",
            '3' => "黄金",
            '4' => "铂金",
            '5' => "钻石",
            '6' => "大师",
            '7' => "王者"
        ],
        'order' => [
            '1' => "1阶",
            '2' => "2阶",
            '3' => "3阶",
            '4' => "4阶",
            '5' => "5阶"
        ],
        'game' => [
            '1' => "斗牛",
            '2' => "斗地主"
        ]
    ]
];