<?php

/*
 * To change this license header, choose License Headers in Project Properties.
 * To change this template file, choose Tools | Templates
 * and open the template in the editor.
 */

/**
 * Description of game
 *
 * @author 七彩P1
 */
return [

    "game" => [//php 区分的游戏
        "dn" => ["name" => "斗牛", "value" => "1"],
        "ddz" => ["name" => "斗地主", "value" => "2"],
        "pdk" => ["name" => "跑得快", "value" => "4"],
        "csmj" => ["name" => "长沙麻将", "value" => "5"],
        "H5dn" => ["name" => "H5斗牛", "value" => "6"],
    ],
    "pfid"=>["1"=>"官方","2"=>"马甲包","3"=>"应用宝","4"=>"vivo","5"=>"opopo","6"=>"华为","7"=>"酷派"],
    "gameid" => [//server的服务id
        "1" => "牛牛", "2" => "斗地主", "3" => "中发白","11"=>"长沙麻将","14" => "跑得快",
    ],
    "gametype" => [//这个跟gameid关联
        //1.经典 2.百人 斗地主1经典 2癞子 3比赛 4排位赛
        "1" => [//斗牛
            "1" => "经典", "2" => "百人"
        ],
        "2" => [//斗地主
            "1" => "经典", "2" => "癞子", "3" => "比赛", "4" => "排位赛"
        ],
        "3" => [//中发白
            "1301" => "普通场"
        ],
        "14" => [//
            "1" => "十五张","2" => "十六张",
        ],
    ],
    "card"=>[//牌型
        "3"=>[
            "1"=>"一筒","2"=>"二筒","3"=>"三筒","4"=>"四筒","5"=>"五筒","6"=>"六筒","7"=>"七筒","8"=>"八筒","9"=>"九筒","16"=>"中","32"=>"发","48"=>"白",
        ],//中发白
    ],
    "login_type" => [
         "1" => ["0" => "wx", "1" => "微信"],
        "2" => ["0" => "yk", "1" => "游客"],
        "3" => ["0" => "QQ", "1" => "QQ"],
        "4" => ["0" => "mb", "1" => "手机"],
        "5" => ["0" => "zh", "1" => "账号"],
        "6" => ["0" => "oppo", "1" => "oppo登录"],
        "7" => ["0" => "Huawei", "1" => "Huawei登录"],
        "8" => ["0" => "wxGzh", "1" => "微信公众号登录"],
    ],
    "mobile_type"=>[1=>"安卓",2=>"苹果"],
];
