<?php

return
            [
            "connect" => [
                "one" => [
                    "socketIp" => env("SOCKETIP"),
                    "socketPort" => env("SOCKETPORT"),
                    //"defaultTimeout"=>"",
                    //connectionState=>"",
                    "debug" => FALSE
                ],
                "hallServer4" => [//跑得快大厅服
                    "socketIp" => env("PAODEKUAISOCKETIP", "192.168.3.131"),
                    "socketPort" => env("PAODEKUAISOCKETPORT", "14002"),
                    //"defaultTimeout"=>"",
                    //connectionState=>"",
                    "debug" => FALSE
                ],
                "test" => [
                    "socketIp" => env("GOODSSOCKETIP"),
                    "socketPort" => env("GOODSSOCKETPORT"),
                    "debug" => FALSE
                ]
            ],
            "code" =>
                [
                '1' => '扣房费',
                '2' => '娱乐场游戏结算',
                //'3'=>'比赛奖励',
                //'4'=>'破产保护',
                //'5'=>'任务奖励',
                '6' => '玩家上下庄',
                '7' => '娱乐场玩家押注',
                '11' => '新手扣房费',
                '12' => '新手游戏结算',
                '13' => '新手游戏炸弹',
                '21' => '初级扣房费',
                '22' => '初级游戏结算',
                '23' => '初级游戏炸弹',
                '31' => '中级扣房费',
                '32' => '中级游戏结算',
                '33' => '中级游戏炸弹',
                '41' => '高级扣房费',
                '42' => '高级游戏结算',
                '43' => '高级游戏炸弹',
                '51' => '精英扣房费',
                '52' => '精英游戏结算',
                '53' => '精英游戏炸弹',
                '61' => '大师扣房费',
                '62' => '大师游戏结算',
                '63' => '大师游戏炸弹',
                '300' => '注册',
                '301' => '充值购买',
                '302' => '购买道具',
                '303' => '分享奖励',
                '304' => '补救金',
                '305' => '保险箱',
                //'306'=>'比大小',
                //'306'=>'比大小',
                '500' => '后台操作',
                //'501'=>'连续登陆奖励',
                '502' => '夺宝',
                '503' => '实时红包比赛报名',
                "504" => "实时红包比赛场奖励",
                "506" => '排位赛段位奖励',
                "505" => '排位赛排行榜奖励',
                "507" => '定时比赛的报名费', //
                "508" => '定时比赛的奖励',
                "510" => "邮件附件产生的",
                '600' => '分享活动',
                '601' => '邀请朋友',
                //'602'=>'龙船竞赛',
                //'603'=>'粽子兑换',
                //'604'=>'纪念屈原',
                '605' => '分享活动抽奖',
                '606' => '登录活动',
                // '607'=>'惊喜一夏',
                '608' => '任务',
                '611' => '中秋节活动',
                '612' => '其他活动',
            ],
            "code_use" => [
                "admin" => "500",
            ],
            "sendMsgType" => [
                "changMoney" => 1, //金币变动
                "changGoods" => 5, //道具变动
            ],
            "newServerCodeType" => [//新大厅协议定义的code
                "changeMoney" => "10002",
            ],
];
?>